Repository: ChamindaR-design/humble_time_app
Catalog: lib/l10n/app_*.arb
Languages: ja, si

# focusBlockTitle
source: Focus Block
ja: 集中ブロック
si: ලක්ෂ්‍ය කාලය

# breakBlockTitle
source: Break Block
ja: 休憩ブロック
si: විවේක කාලය

source: Time Mosaic Planner
ja: タイムモザイクプランナー
si: කාල මෝසැක් සැලසුම්කරු

source: Log History
ja: ログ履歴
si: ලඝු ඉතිහාසය

source: Actuals
ja: 実績
si: සත්‍ය වාර්තා

source: Pacing
ja: ペーシング
si: වේග සැලසුම

source: Scheduler
ja: スケジューラー
si: කාලසටහන් සකස්කරු

source: Settings
ja: 設定
si: සැකසුම්

source: Journal Review
ja: ジャーナルレビュー
si: දායක සමාලෝචනය

source: Reflection History
ja: 振り返り履歴
si: පැහැදිලි කිරීමේ ඉතිහාසය

# languageSwitched
source: Language switched to English
ja: 言語が日本語に変更されました
si: භාෂාව සිංහලට මාරු විය

# voiceFocusStart
source: Block started. Let’s stay present and keep pacing yourself.
ja: 集中ブロックを開始しました。今に意識を向けて、ペースを保ちましょう。
si: ලක්ෂ්‍ය කාලය ආරම්භ විය. දැන් පැහැදිලිව සිටින්න.

# voiceFocusComplete
source: Well done. That was focused time well spent. Want to log how it felt?
ja: お疲れさまでした。集中した時間をしっかり使えましたね。気分を記録しますか？
si: ඔබ හොඳින් කටයුතු කළා. ලක්ෂ්‍ය කාලය සුරකින්නද?

# voiceIdleDetected
source: Looks like there’s been a gap. Shall we restart your block or save progress?
ja: 少し間が空いたようです。ブロックを再開しますか？それとも進捗を保存しますか？
si: ඔබ තාවකාලිකව නවතා ඇත. නැවත ආරම්භ කරන්නද නැත්නම් සුරකින්නද?

# voiceBreakStart
source: Time for a break
ja: 休憩の時間です
si: විවේක ගන්න වේලාවයි

# voiceMoodPrompt
source: How are you feeling right now?
ja: 今の気分はどうですか？
si: ඔබේ වර්තමාන භාවනාව කුමක්ද?

# voiceMoodSaved
source: Mood saved. Let’s continue.
ja: 気分を保存しました。続けましょう。
si: භාවනාව සුරකින ලදී. ඉදිරියට යමු.

# voiceMoodSelected
source: Mood {mood} selected. Let's continue.
ja: 「{mood}」が選択されました。続けましょう。
si: {mood} ලෙස භාවනාව තෝරාගෙන ඇත. ඉදිරියට යමු.

# voiceWelcomeBack
source: Welcome back. Ready to build your next focus block?
ja: おかえりなさい。次の集中ブロックを始めましょうか？
si: ආයුබෝවන්! නැවත ආරම්භ කරන්නද?

# voiceLeavingSession
source: Leaving so soon? Want to save this session before you head out?
ja: もう終了しますか？このセッションを保存してから退出しますか？
si: ඔබ පිටවීමට සූදානම්ද? මෙම සැසිය සුරකින්නද?

# voiceGenericFallback
source: Let's keep going.
ja: 続けましょう。
si: ඉදිරියට යමු.

source: Mood
ja: 気分
si: භාවනාව

# moodHappy
source: Happy
ja: うれしい
si: සතුටු

# moodNeutral
source: Neutral
ja: 普通
si: සාමාන්‍ය

# moodSad
source: Sad
ja: 悲しい
si: දුකින්

# moodCrying
source: Crying
ja: 泣いている
si: අඬනවා

# moodJoyful
source: Joyful
ja: 喜び
si: සතුටු

# moodAngry
source: Angry
ja: 怒っている
si: කෝපයෙන්

# moodSurprised
source: Surprised
ja: 驚き
si: පුදුමයෙන්

# moodConfused
source: Confused
ja: 混乱している
si: අවුල්වීම

# moodSleepy
source: Sleepy
ja: 眠い
si: නිදාගන්නටයි
